Revit 2027 API
PointCloudType.ColorEncoding Property
 The color encoding used by points extracted from instances of this point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorEncoding ColorEncoding { get; }
Public ReadOnly Property ColorEncoding As PointCloudColorEncoding
	Get
public:
property PointCloudColorEncoding ColorEncoding {
	PointCloudColorEncoding get ();
}
member ColorEncoding : PointCloudColorEncoding with get
Property Value
PointCloudColorEncoding
See Also
Reference
PointCloudType Class
Autodesk.Revit.DB Namespace